Pandas DataFrame consists of three principal components,
the data, rows, and columns.
* numpy Matrix can store single data type while dataframe can store multiple datatype
* advance version of numpy is pandas for data analysis
* series has custome index value, vector does not have
* dataframe constructed by multiple series values

In [2]:
import pandas as pd

In [5]:
df=pd.read_csv("data.csv")

In [6]:
df

  Name  Roll Branch
0  aaa   111    cse
1   bb    22     it
2   cc    12    ece

In [7]:
# DataFrame can be created using a single list or a list of lists.
import pandas as pd

lst = ['akd', 'akdsc', 'unacademy','ins']
 
# Calling DataFrame constructor on list
df = pd.DataFrame(lst)
print(df)

           0
0        akd
1      akdsc
2  unacademy
3        ins

In [17]:

import pandas as pd
 
# Define a dictionary containing employee data
data = {'Name':['arun', 'pankaj', 'aaaa','ddd'],
        'Age':[32,23,24,44],
        'Address':['Delhi', 'mumbai','oida','gurugram'],
        'Qualification':['PhD', 'MTECH','MSC','BBA']}
 
# Convert the dictionary into DataFrame 
df = pd.DataFrame(data)
df

     Name  Age   Address Qualification
0    arun   32     Delhi           PhD
1  pankaj   23    mumbai         MTECH
2    aaaa   24      oida           MSC
3     ddd   44  gurugram           BBA

In [22]:
print(df[['Name','Age']])

     Name  Age
0    arun   32
1  pankaj   23
2    aaaa   24
3     ddd   44

In [23]:
#add new column in data frame
df['marks']=[45,67,23,32]

In [24]:
#
df

     Name  Age   Address Qualification  marks
0    arun   32     Delhi           PhD     45
1  pankaj   23    mumbai         MTECH     67
2    aaaa   24      oida           MSC     23
3     ddd   44  gurugram           BBA     32

In [27]:
df.drop('Age',axis=1)              
# Use axis=0 for dropping rows and axis=1 for dropping columns

     Name   Address Qualification  marks
0    arun     Delhi           PhD     45
1  pankaj    mumbai         MTECH     67
2    aaaa      oida           MSC     23
3     ddd  gurugram           BBA     32

In [28]:
# column is not dropped unless inplace input is TRUE
df

     Name  Age   Address Qualification  marks
0    arun   32     Delhi           PhD     45
1  pankaj   23    mumbai         MTECH     67
2    aaaa   24      oida           MSC     23
3     ddd   44  gurugram           BBA     32

In [30]:
df.drop('Age',axis=1,inplace=True)

In [31]:
df

     Name   Address Qualification  marks
0    arun     Delhi           PhD     45
1  pankaj    mumbai         MTECH     67
2    aaaa      oida           MSC     23
3     ddd  gurugram           BBA     32

In [32]:
df.drop(2,axis=0)     
# Row will also be dropped only if inplace=TRUE is given as input

     Name   Address Qualification  marks
0    arun     Delhi           PhD     45
1  pankaj    mumbai         MTECH     67
3     ddd  gurugram           BBA     32

In [33]:
df

     Name   Address Qualification  marks
0    arun     Delhi           PhD     45
1  pankaj    mumbai         MTECH     67
2    aaaa      oida           MSC     23
3     ddd  gurugram           BBA     32

In [34]:
df.drop(2,axis=0,inplace=True)

In [35]:
df

     Name   Address Qualification  marks
0    arun     Delhi           PhD     45
1  pankaj    mumbai         MTECH     67
3     ddd  gurugram           BBA     32

In [36]:
#This function selects data by the label of the rows and columns
df.loc[1]

Name             pankaj
Address          mumbai
Qualification     MTECH
marks                67
Name: 1, dtype: object

In [38]:
#display column name
df.columns

Index(['Name', 'Address', 'Qualification', 'marks'], dtype='object')

In [39]:
type(df['Name'])

pandas.core.series.Series

In [41]:
df

     Name   Address Qualification  marks
0    arun     Delhi           PhD     45
1  pankaj    mumbai         MTECH     67
3     ddd  gurugram           BBA     32

In [42]:
df['marks'].max()

67

In [43]:
df['marks'].min()

32

In [50]:
#conditional operation
df[df.marks>50]

     Name Address Qualification  marks
1  pankaj  mumbai         MTECH     67

In [51]:
#extract name who has achieved highest marks
df['Name'][df.marks==df['marks'].max()]

1    pankaj
Name: Name, dtype: object

In [52]:
#check index
df.index

Int64Index([0, 1, 3], dtype='int64')

In [49]:
#statistics
df.describe()

           marks
count   3.000000
mean   48.000000
std    17.691806
min    32.000000
25%    38.500000
50%    45.000000
75%    56.000000
max    67.000000

In [55]:
#if you want to set any column as index
#return new dataframe does not modify original one
ndf=df.set_index('Name')
ndf
#if you want to change orginal on then use implace=True
#df.set_index('Name',inplace=True)

         Address Qualification  marks
Name
arun       Delhi           PhD     45
pankaj    mumbai         MTECH     67
ddd     gurugram           BBA     32

In [59]:
ndf.loc['ddd']
#if index is not unique it will display all rows with same index name

Address          gurugram
Qualification         BBA
marks                  32
Name: ddd, dtype: object

In [60]:
#Checking for missing values using isnull() and notnull()
df.isnull()

    Name  Address  Qualification  marks
0  False    False          False  False
1  False    False          False  False
3  False    False          False  False

In [61]:
df.notnull()
#Missing Data can occur when no information is provided for one or more items or for a whole unit

   Name  Address  Qualification  marks
0  True     True           True   True
1  True     True           True   True
3  True     True           True   True

In [66]:
import numpy as np
dict = {'First ':[10, np.nan, 9,56],
        'Second': [5, 6, np.nan,89],
        'Third ':[34,np.nan, 67, 8]}
 
# creating a dataframe from dictionary
df = pd.DataFrame(dict)
print(df)
# filling missing value using fillna()  
df.fillna(0)

   First   Second  Third
0    10.0     5.0    34.0
1     NaN     6.0     NaN
2     9.0     NaN    67.0
3    56.0    89.0     8.0

   First   Second  Third
0    10.0     5.0    34.0
1     0.0     6.0     0.0
2     9.0     0.0    67.0
3    56.0    89.0     8.0

In [67]:
df

   First   Second  Third
0    10.0     5.0    34.0
1     NaN     6.0     NaN
2     9.0     NaN    67.0
3    56.0    89.0     8.0

In [68]:
#we drop rows with at least one Nan value (Null value)
# using dropna() function  
df.dropna()

   First   Second  Third
0    10.0     5.0    34.0
3    56.0    89.0     8.0

In [62]:
#Filling missing values using fillna()
df.fillna(0)
#it will fill missing values with 0
# function replace NaN values with some value of their own

     Name   Address Qualification  marks
0    arun     Delhi           PhD     45
1  pankaj    mumbai         MTECH     67
3     ddd  gurugram           BBA     32

In [70]:
import pandas as pd
df1=pd.read_csv("C:\\Users\\ambuj\\OneDrive\\Desktop\\data.csv")
df1

  Name  Roll Branch
0  aaa   111    cse
1   bb    22     it
2   cc    12    ece

In [76]:
df2=pd.read_csv("Automobile_data.csv")
df2.head()

,index,company,body-style,wheel-base,length,engine-type,num-of-cylinders,horsepower,average-mileage,price
0,0,alfa-romero,convertible,88.6,168.8,dohc,four,111,21,13495.0
1,1,alfa-romero,convertible,88.6,168.8,dohc,four,111,21,16500.0
2,2,alfa-romero,hatchback,94.5,171.2,ohcv,six,154,19,16500.0
3,3,audi,sedan,99.8,176.6,ohc,four,102,24,13950.0
4,4,audi,sedan,99.4,176.6,ohc,five,115,18,17450.0

In [40]:
#Pandas
#Data Type Name - Series
#in numpy ndarrays and pandas Series object
#elements in NumPy arrays are accessed by their integer position,
#starting with zero for the first element.
#A pandas Series Object is more flexible as you can use define your own labeled index to index and access elements of an array

In [45]:
#convert a list,numpy array, or dictionary to a Series in the following manner
import numpy as np
l = ['aa','xx','yy','zz']
list = [110,220,330,440]
arr = np.array([100,200,300,400])
dict = {'aa':10,'xx':20,'yy':30,'zz':40}

In [46]:
pd.Series(data=list)

0    110
1    220
2    330
3    440
dtype: int64

In [47]:
pd.Series(data=list,index=l)# "l" is first list

aa    110
xx    220
yy    330
zz    440
dtype: int64

In [48]:
pd.Series(list,l)

aa    110
xx    220
yy    330
zz    440
dtype: int64

In [77]:
pd.Series(arr)

0    100
1    200
2    300
3    400
dtype: int32

In [78]:
pd.Series(arr,l)

aa    100
xx    200
yy    300
zz    400
dtype: int32

In [79]:
pd.Series(dict)

First     [10, nan, 9, 56]
Second     [5, 6, nan, 89]
Third     [34, nan, 67, 8]
dtype: object

In [1]:
#check missing value
import pandas as pd

In [2]:
df=pd.read_csv('data.csv')

In [3]:
df

  Name   Roll Branch
0  aaa  111.0    cse
1   bb   22.0     it
2   cc   12.0    ece
3  ttt    NaN    cse
4  kkk    NaN    NaN

In [ ]:
#groupby
#The groupby method is used to group rows together and perform aggregate functions

In [1]:
import pandas as pd
df2 = pd.DataFrame({'X': ['B', 'B', 'A', 'A'], 'Y': [1, 2, 3, 4]})

In [2]:
df2.groupby(['X']).sum()

   Y
X
A  7
B  3

In [3]:
df2.groupby(['Y']).sum()

   X
Y
1  B
2  B
3  A
4  A

In [5]:
 # You may however pass sort=False for potential speedups
df2.groupby(['X'], sort=False).sum()

   Y
X
B  3
A  7

In [6]:
 #groupby will preserve the order in which observations are sorted within each group
 #For example, the groups created by groupby() below are in the order they appeared in the original DataFrame
df3 = pd.DataFrame({'X': ['A', 'B', 'A', 'B'], 'Y': [1, 4, 3, 2]})

In [7]:
df3.groupby(['X']).get_group('A')

   X  Y
0  A  1
2  A  3

In [8]:
df3.groupby(['X']).get_group('B')

   X  Y
1  B  4
3  B  2

In [9]:
# Create dataframe as given below
dat = {'CustID':['1001','1001','1002','1002','1003','1003'],
       'CustName':['UIPat','DatRob','Goog','Chrysler','Ford','GM'],
       'Profitinlakhs':[2005,3245,1245,8765,5463,3547]}

In [10]:
dataframe = pd.DataFrame(dat)
dataframe

  CustID  CustName  Profitinlakhs
0   1001     UIPat           2005
1   1001    DatRob           3245
2   1002      Goog           1245
3   1002  Chrysler           8765
4   1003      Ford           5463
5   1003        GM           3547

In [11]:
dataframe.groupby('CustID')

In [12]:
CustID_grouped = dataframe.groupby("CustID")
CustID_grouped

In [13]:
CustID_grouped.mean()

        Profitinlakhs
CustID
1001             2625
1002             5005
1003             4505

In [14]:
dataframe.groupby('CustID').mean()

        Profitinlakhs
CustID
1001             2625
1002             5005
1003             4505

In [15]:
CustID_grouped.std()

        Profitinlakhs
CustID
1001       876.812409
1002      5317.442995
1003      1354.816593

In [16]:
#join=> best for same column values
#in concatenate, even they are duplicate values ..treated as unique

In [17]:
#merge
dict1 = {'city':['dd','ff', 'kk'],
        'distance': [5, 6,9],}
 
# creating a dataframe from dictionary
df1 = pd.DataFrame(dict1)

dict2 = {'city':['dd','ff', 'kk'],
        'distance': [50, 60,90],}
 
# creating a dataframe from dictionary
df2 = pd.DataFrame(dict2)

In [20]:
df3=pd.merge(df1,df2,on="city")

In [21]:
df3

  city  distance_x  distance_y
0   dd           5          50
1   ff           6          60
2   kk           9          90

In [22]:
#merge
dict1 = {'city':['dd','ff', 'kk'],
        'distance': [5, 6,9],}
 
# creating a dataframe from dictionary
df1 = pd.DataFrame(dict1)

dict2 = {'city':['dd','hh', 'kk'],
        'distance': [50, 60,90],}
 
# creating a dataframe from dictionary
df2 = pd.DataFrame(dict2)

In [23]:
df3=pd.merge(df1,df2,on="city")#only intersection part

In [24]:
df3

  city  distance_x  distance_y
0   dd           5          50
1   kk           9          90

In [25]:
df3=pd.merge(df1,df2,on="city",how="outer")#select all in set

In [26]:
df3

  city  distance_x  distance_y
0   dd         5.0        50.0
1   ff         6.0         NaN
2   kk         9.0        90.0
3   hh         NaN        60.0

In [27]:
df3=pd.merge(df1,df2,on="city",how="inner")

In [28]:
df3

  city  distance_x  distance_y
0   dd           5          50
1   kk           9          90

In [29]:
df3=pd.merge(df1,df2,on="city",how="left")
df3

  city  distance_x  distance_y
0   dd           5        50.0
1   ff           6         NaN
2   kk           9        90.0

In [30]:
df3=pd.merge(df1,df2,on="city",how="right")
df3

  city  distance_x  distance_y
0   dd         5.0          50
1   kk         9.0          90
2   hh         NaN          60

In [31]:
#concatenat
dict1 = {'city':['dd','ff', 'kk'],
        'distance': [5, 6,9],}
 
# creating a dataframe from dictionary
df1 = pd.DataFrame(dict1)

dict2 = {'city':['dd','hh', 'kk'],
        'distance': [50, 60,90],}
 
# creating a dataframe from dictionary
df2 = pd.DataFrame(dict2)

In [32]:
ndf=pd.concat([df1,df2])

In [33]:
ndf

  city  distance
0   dd         5
1   ff         6
2   kk         9
0   dd        50
1   hh        60
2   kk        90